### 파일 열기 및 저장

In [2]:
import pandas as pd
data = {
    '이름':['김길동','이길동','강길동','홍길동','박길동','나길동'],
    '주소':['광주','서울','대구','대전','광주','서울'],
    '나이':[33,23,30,20,21,25],
    '점수':[76,88,98,100,60,90],
    '언어':['Python','Java','C++','','','C']
}
df = pd.DataFrame(data, index=['1번','2번','3번','4번','5번','6번'] )
df.index.name = '번호'
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100
5번  박길동  광주  21   60
6번  나길동  서울  25   90       C

### DataFrame => 파일로 저장(csv)

### 텍스트(.txt) 파일로 저장

### 엑셀 파일로 저장

***

### CSV 파일 열기

   번호   이름  주소  나이   점수      언어
0  1번  김길동  광주  33   76  Python
1  2번  이길동  서울  23   88    Java
2  3번  강길동  대구  30   98     C++
3  4번  홍길동  대전  20  100     NaN
4  5번  박길동  광주  21   60     NaN
5  6번  나길동  서울  25   90       C

   2번  이길동  서울  23   88 Java
0  3번  강길동  대구  30   98  C++
1  4번  홍길동  대전  20  100  NaN
2  5번  박길동  광주  21   60  NaN
3  6번  나길동  서울  25   90    C

   번호   이름  주소  나이   점수    언어
0  2번  이길동  서울  23   88  Java
1  4번  홍길동  대전  20  100   NaN
2  6번  나길동  서울  25   90     C

   번호   이름  주소  나이  점수      언어
0  1번  김길동  광주  33  76  Python
1  2번  이길동  서울  23  88    Java
2  3번  강길동  대구  30  98     C++

   2번  이길동  서울  23   88 Java
0  3번  강길동  대구  30   98  C++
1  4번  홍길동  대전  20  100  NaN
2  5번  박길동  광주  21   60  NaN

### 텍스트 파일 열기

   번호   이름  주소  나이   점수      언어
0  1번  김길동  광주  33   76  Python
1  2번  이길동  서울  23   88    Java
2  3번  강길동  대구  30   98     C++
3  4번  홍길동  대전  20  100     NaN
4  5번  박길동  광주  21   60     NaN
5  6번  나길동  서울  25   90       C

   번호   이름  주소  나이   점수      언어
0  1번  김길동  광주  33   76  Python
1  2번  이길동  서울  23   88    Java
2  3번  강길동  대구  30   98     C++
3  4번  홍길동  대전  20  100     NaN
4  5번  박길동  광주  21   60     NaN
5  6번  나길동  서울  25   90       C

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

### 엑셀 파일 열기

   번호   이름  주소  나이   점수      언어
0  1번  김길동  광주  33   76  Python
1  2번  이길동  서울  23   88    Java
2  3번  강길동  대구  30   98     C++
3  4번  홍길동  대전  20  100     NaN
4  5번  박길동  광주  21   60     NaN
5  6번  나길동  서울  25   90       C

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C